# Core
brew "stow"
brew "zsh"
brew "git"
brew "git-lfs"
brew "neovim"
brew "tmux"
brew "direnv"
brew "node"
brew "just"

# CLI tools
brew "ripgrep"
brew "fd"
brew "jq"
brew "gnu-sed"
brew "broot"
brew "git-delta"
# carbonyl — not in Homebrew, install from GitHub releases on Linux

# TUI
brew "lazygit"
brew "lazysql"
brew "tmuxinator"

# Database
brew "duckdb"
brew "postgresql@17"
brew "pgvector"

# Secrets
brew "infisical"

# Notifications
brew "terminal-notifier"

# GUI
cask "alacritty"
cask "nikitabobko/tap/aerospace"
